app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all(:order => "created_at DESC")

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "content" = 'Can you read this? If you can then the code for creating a post has <br /> worked. Hopefully you can''t delete it.', "updated_at" = '2012-07-12 06:27:22.807148' WHERE "posts"."id" = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])